## Staging: load-balancer
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`




**⚠️ &nbsp; WARNING:** resources will be destroyed by this change!


```terraform
Plan: 4 to add, 2 to change, 4 to destroy
```


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_iam_policy.firehose_waf_logs will be updated in-place
  ~ resource "aws_iam_policy" "firehose_waf_logs" {
        id        = "arn:aws:iam::729164266357:policy/FirehoseWafLogsPolicy"
        name      = "FirehoseWafLogsPolicy"
      ~ policy    = jsonencode(
          ~ {
              ~ Statement = [
                  ~ {
                      ~ Resource = [
                          - "arn:aws:s3:::platform-ircc-staging-waf-logs/*",
                          - "arn:aws:s3:::platform-ircc-staging-waf-logs",
                          + "arn:aws:s3:::cbs-satellite-729164266357/*",
                          + "arn:aws:s3:::cbs-satellite-729164266357",
                        ]
                        # (3 unchanged elements hidden)
                    },
                    {
                        Action   = "iam:CreateServiceLinkedRole"
                        Effect   = "Allow"
                        Resource = "arn:aws:iam::*:role/aws-service-role/wafv2.amazonaws.com/AWSServiceRoleForWAFV2Logging"
                        Sid      = ""
                    },
                ]
                # (1 unchanged element hidden)
            }
        )
        tags      = {}
        # (4 unchanged attributes hidden)
    }

  # aws_kinesis_firehose_delivery_stream.firehose_waf_logs must be replaced
-/+ resource "aws_kinesis_firehose_delivery_stream" "firehose_waf_logs" {
      ~ arn            = "arn:aws:firehose:ca-central-1:729164266357:deliverystream/aws-waf-logs-platform-ircc" -> (known after apply)
      ~ destination    = "s3" -> "extended_s3" # forces replacement
      ~ destination_id = "destinationId-000000000001" -> (known after apply)
      ~ id             = "arn:aws:firehose:ca-central-1:729164266357:deliverystream/aws-waf-logs-platform-ircc" -> (known after apply)
        name           = "aws-waf-logs-platform-ircc"
      ~ tags           = {
          + "Terraform"  = "true"
            # (1 unchanged element hidden)
        }
      ~ tags_all       = {
          + "Terraform"  = "true"
            # (1 unchanged element hidden)
        }
      ~ version_id     = "2" -> (known after apply)

      + extended_s3_configuration {
          + bucket_arn         = "arn:aws:s3:::cbs-satellite-729164266357"
          + buffer_interval    = 300
          + buffer_size        = 5
          + compression_format = "GZIP"
          + prefix             = "waf_acl_logs/AWSLogs/729164266357/"
          + role_arn           = "arn:aws:iam::729164266357:role/FirehoseWafLogs"
          + s3_backup_mode     = "Disabled"

          + cloudwatch_logging_options {
              + enabled         = (known after apply)
              + log_group_name  = (known after apply)
              + log_stream_name = (known after apply)
            }
        }

      - s3_configuration {
          - bucket_arn         = "arn:aws:s3:::platform-ircc-staging-waf-logs" -> null
          - buffer_interval    = 300 -> null
          - buffer_size        = 5 -> null
          - compression_format = "UNCOMPRESSED" -> null
          - role_arn           = "arn:aws:iam::729164266357:role/FirehoseWafLogs" -> null

          - cloudwatch_logging_options {
              - enabled = false -> null
            }
        }

      ~ server_side_encryption {
            # (2 unchanged attributes hidden)
        }
    }

  # aws_kinesis_firehose_delivery_stream.firehose_waf_logs_us_east must be replaced
-/+ resource "aws_kinesis_firehose_delivery_stream" "firehose_waf_logs_us_east" {
      ~ arn            = "arn:aws:firehose:us-east-1:729164266357:deliverystream/aws-waf-logs-platform-ircc-us-east" -> (known after apply)
      ~ destination    = "s3" -> "extended_s3" # forces replacement
      ~ destination_id = "destinationId-000000000001" -> (known after apply)
      ~ id             = "arn:aws:firehose:us-east-1:729164266357:deliverystream/aws-waf-logs-platform-ircc-us-east" -> (known after apply)
        name           = "aws-waf-logs-platform-ircc-us-east"
      ~ tags           = {
          + "Terraform"  = "true"
            # (1 unchanged element hidden)
        }
      ~ tags_all       = {
          + "Terraform"  = "true"
            # (1 unchanged element hidden)
        }
      ~ version_id     = "2" -> (known after apply)

      + extended_s3_configuration {
          + bucket_arn         = "arn:aws:s3:::cbs-satellite-729164266357"
          + buffer_interval    = 300
          + buffer_size        = 5
          + compression_format = "GZIP"
          + prefix             = "waf_acl_logs/AWSLogs/729164266357/"
          + role_arn           = "arn:aws:iam::729164266357:role/FirehoseWafLogs"
          + s3_backup_mode     = "Disabled"

          + cloudwatch_logging_options {
              + enabled         = (known after apply)
              + log_group_name  = (known after apply)
              + log_stream_name = (known after apply)
            }
        }

      - s3_configuration {
          - bucket_arn         = "arn:aws:s3:::platform-ircc-staging-waf-logs" -> null
          - buffer_interval    = 300 -> null
          - buffer_size        = 5 -> null
          - compression_format = "UNCOMPRESSED" -> null
          - role_arn           = "arn:aws:iam::729164266357:role/FirehoseWafLogs" -> null

          - cloudwatch_logging_options {
              - enabled = false -> null
            }
        }

      ~ server_side_encryption {
            # (2 unchanged attributes hidden)
        }
    }

  # aws_wafv2_web_acl_logging_configuration.firehose_waf_logs_alb must be replaced
-/+ resource "aws_wafv2_web_acl_logging_configuration" "firehose_waf_logs_alb" {
      ~ id                      = "arn:aws:wafv2:ca-central-1:729164266357:regional/webacl/wordpress_waf_alb/fefa835e-6ab7-41eb-a69c-d8e1d0ac80f4" -> (known after apply)
      ~ log_destination_configs = [
          - "arn:aws:firehose:ca-central-1:729164266357:deliverystream/aws-waf-logs-platform-ircc",
        ] -> (known after apply) # forces replacement
        # (1 unchanged attribute hidden)
    }

  # aws_wafv2_web_acl_logging_configuration.firehose_waf_logs_cloudfront must be replaced
-/+ resource "aws_wafv2_web_acl_logging_configuration" "firehose_waf_logs_cloudfront" {
      ~ id                      = "arn:aws:wafv2:us-east-1:729164266357:global/webacl/wordpress_waf/d578506d-443d-45bc-afe7-182599e8d052" -> (known after apply)
      ~ log_destination_configs = [
          - "arn:aws:firehose:us-east-1:729164266357:deliverystream/aws-waf-logs-platform-ircc-us-east",
        ] -> (known after apply) # forces replacement
        # (1 unchanged attribute hidden)
    }

  # module.firehose_waf_log_bucket.aws_s3_bucket.this will be updated in-place
  ~ resource "aws_s3_bucket" "this" {
        id                          = "platform-ircc-staging-waf-logs"
        tags                        = {
            "CostCentre" = "PlatformGCArticles"
            "Terraform"  = "true"
        }
        # (10 unchanged attributes hidden)

      ~ lifecycle_rule {
            id                                     = "expire"
            tags                                   = {}
            # (2 unchanged attributes hidden)

          ~ expiration {
              ~ days                         = 90 -> 30
                # (1 unchanged attribute hidden)
            }
        }


        # (2 unchanged blocks hidden)
    }

Plan: 4 to add, 2 to change, 4 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>